/***********************************************************************

                  字符编解码模块

***********************************************************************/

#ifndef __CODE_H
#define __CODE_H

/****************************************************************************
		                      相关配置
****************************************************************************/

//代码任务用于防止集中处理Unicode码至GB2312时间太长问题
//#define SUPPORT_CODE_TASK   

/****************************************************************************
		                      相关结构--SUPPORT_CODE_TASK相关
****************************************************************************/
#ifdef SUPPORT_CODE_TASK
struct _Code{
  const unsigned char *pUcs2;     //待解码的Ucs2码流,为空表示无任务
  unsigned char *pGB2312;         //处理完成的GB2312码流
  void(*FinalNotify)(unsigned short); //处理完成通报函数,返回为字符长度
  unsigned short UnicodeLen;      //Unicode长度
  unsigned short UnicodePos;      //正准备处理的位置  
  unsigned short GB2312Pos;       //准备放置的位置    
};

extern struct _Code Code;

/****************************************************************************
		                      相关函数-SUPPORT_CODE_TASK相关
****************************************************************************/

//-----------------------------初始化函数------------------------------------
//开机时调用
void Code_Init(void);

//----------利用空闲时间处理Ucs2码流到混合GB2312码流启动函数---------------------
//MSB方式(高位在前)处理, 返回是否接收成功!
signed char Code_Ucs2ToGB2312Start(const unsigned char *pUcs2,  //MSB方式
                                   unsigned char *pGB2312,       //MSB方式
                                   unsigned short Len,          //Unicode码字节流长度
                                   void(*FinalNotify)(unsigned short)); //处理完成通报函数

//-----------------------------空闲任务函数------------------------------------
//放入系统空闲进程中扫描
void Code_FastTask(void);

#endif //#ifdef SUPPORT_CODE_TASK

/****************************************************************************
		                      相关结构-独立调用
****************************************************************************/

//-------------------混合GB2312码流转换成Ucs2码流函数------------------------
//返回转换后的字符长度
unsigned short Code_GB2312ToUcs(const char *pGB2312, //MSB方式
                                unsigned char *pUcs2,          //MSB方式
                                unsigned short Len);           //字符长度

//--------------------------Ucs2码流到混合GB2312码流函数---------------------
//MSB方式(高位在前)处理, 返回转换后的字符长度
//注意此函数需要的处理时间较长！！
unsigned short Code_Ucs2ToGB2312(const unsigned char *pUcs2,  //MSB方式
                                 char *pGB2312,       //MSB方式
                                 unsigned short Len);        //Unicode码字节流长度                    

#endif


 