/***********************************************************************

                  Mqtt用户用户信息模块-通过AT指令访问接口
此模块将用户内容替换为当前内容并返回
此模块主要对MqttConUser模块进行管理,与应用无关
***********************************************************************/
#ifndef __MQTT_CON_USER_AT_H
#define	__MQTT_CON_USER_AT_H

/******************************************************************************
		                        相关函数
******************************************************************************/

#include "MqttConUser.h"

//-----------------------------主解析函数-------------------------------
//返回结果字符,不返回时为NULL
const char *MqttConUserAT_pParser(struct _MqttConUser *pConUser,
                                   char *pContent);//要解析内容,ascii码



#endif




