/*******************************************************************************

                     Mqtt协议-用户接口定义
此定义配合MqttMng以与应用层交互
*******************************************************************************/
#ifndef MQTT_USER_H
#define MQTT_USER_H


/*******************************************************************************
                            相关结构
*******************************************************************************/

#include "MqttPacket.h"

//管理器需要的用户订阅信息的主题过滤器列表(注意不要太多以免长度超限，可多个)
struct _MqttUserSubscribe{
  MQTTString *pTopicAry;      //订阅的主题过滤器阵列
  int *pQoS;                  //对应阵列的服务级别,0,1,2
  
  unsigned short identifier;       //此订阅信息的报文标识符,需应用唯一
  unsigned char Len;               //主题阵列长度
};

//用户相关信息
struct _MqttUser{
  char *pClientId;            //客户端ID号,NULL表示无
  char *pUserName;            //用户登录的名称,NULL表示无
  char *pUserPass;            //用户登录的密码
  
  struct _MqttUserSubscribe *pSubscribeAry; //要订阅的主题过滤器列表阵列
  unsigned char SubscribeAryCount;         //要订阅的主题过滤器列表阵列总数  
  
  unsigned short KeepAlive;  //保活时间，s为单位
};

/*******************************************************************************
                          相关函数
*******************************************************************************/


#endif //MQTT_USER_H
