/******************************************************************************

         ModbusRtuMng模块-QMenu参数接口

*******************************************************************************/
#ifndef _MODBUS_RTU_MNG_QMENU_H
#define _MODBUS_RTU_MNG_QMENU_H

#include "QMenuPara.h"

/******************************************************************************
                         QMenu参数接口
*******************************************************************************/

//---------------------------通讯位配置----------------------------------
//位定义见UsartDevCfg.h
extern const struct _QMenuFun ModbusRtuMngQMenu_BitCfg;

//----------------------------读写通讯地址---------------------------------
extern const struct _QMenuFun ModbusRtuMngQMenu_Adr;

#endif



