/*******************************************************************************

                      总线计数器结构
//允许回环
*******************************************************************************/
#ifndef __BUS_COUNT_H
#define	__BUS_COUNT_H

//----------------------------------主结构----------------------------------
//仅定义结构， 允许直接成员访问
struct _BusCount{
  unsigned long Comm;          //通讯次数计数   
  unsigned long Valid;         //有效数据计数
  unsigned long Invalid;       //无效数据计数(各种校验或数据错误  
};

//------------------------------初始化函数-----------------------------------
#include <string.h>
#define BusCount_Init(p) do{memset(p, 0, sizeof(struct _BusCount));} while(0)

//--------------------------由总线ID得主结构--------------------------------
//此为回调函数由应用实现，可通过此函数转换以获得派生类
struct _BusCount *BusCount_pcbGet(unsigned char BusId);



#endif




