/***********************************************************************

                    Bus Id 对应的挂接
此接口与实现独立于应用
***********************************************************************/
#ifndef __BUS_MOUNT_H
#define	__BUS_MOUNT_H

/***********************************************************************
                        相关结构
***********************************************************************/
#include "BusIdDef.h" //总线ID及类型定义(应用相关)
#include "BusCount.h" //基类

//----------------------------主结构-----------------------------------
struct _BusMount{
  //与BusId对应的总线指针, 最终类结构必须派生至struct _BusCount
  struct _BusCount *pBusMount[BUS_ID_COUNT]; 
};

extern struct _BusMount BusMount; //直接单例化

/***********************************************************************
                           相关函数
***********************************************************************/

//------------------------------开机初始化-----------------------------
void BusMount_Init(void); 

//----------------------------------挂接-------------------------------
//总线创建后调用
void BusMount_Mount(unsigned char BusId, struct _BusCount *pBase); 

//--------------------------------得到结构------------------------------
//若由struct _BusCount派生，则可直接转换为其结构
//返回NULL未挂接或不支持
struct _BusCount *BusMount_GetBase(unsigned char BusId); 



#endif //#define	__BUS_MOUNT_H

