/*******************************************************************************

//		                   Deflate 精简型 解码器
此模块主要用于Deflate压缩格式，如GZIP PNG图片的解码
此模块修改出自"lodepng", 感谢作者！！！！！
此模块为重新整理以学习，分析代码以为加深印像，并符合现编码规则，以方便使用
此模块针对嵌入式系统，做了部分优化
*******************************************************************************/
#ifndef _DEFLATE_NANO_H
#define _DEFLATE_NANO_H

#include "bReader.h"
#include "WinWriter.h"
#include "HuffmanTree.h"


/*******************************************************************************
                             相关配置
********************************************************************************/


//must be at least 258 for max length, and a few extra for adding a few extra literals */
//out->data数据区应有足够的空间，需大于下述累架值,建议>=其1.5倍
#define DEFLATE_NANO_OUT_RESERVED_SIZE  260 //定义保留字节,out->data数据足够时最少260
#define DEFLATE_NANO_OUT_LEAVED_SIZE    260 //定义留空字节,以备后用,建立260

/*******************************************************************************
                             相关函数
*******************************************************************************/

//--------------------------------译码函数-------------------------------------
//原inflateHuffmanBlock
signed char DeflateNano_Decoder(const unsigned char *data,//输入数据流
                                 brsize_t insize,           //数据个数
                                 winWriter_t *out);       //已准备好的接收数据缓冲

/*******************************************************************************
                             相关回调函数
*******************************************************************************/

//------------------------得到哈夫曼树管理器缓冲------------------------------
struct _HuffmanTreeMng *DeflateNono_cbGetuffmanTreeMng(void);

//------------------------得到哈夫曼树缓冲器缓冲------------------------------
struct _HuffmanTreeBuf *DeflateNono_cbGetuffmanTreeBuf(void);


#endif //_DEFLATE_NANO_H


