/*******************************************************************************
                   由PWM产生模拟量输出模块在AVR单片机中的实现
使用16位TCNT1持续与OCR1x的内容比较，一旦发现它们相等，
比较器立即产生一个匹配信号;本程序采用模式14(快速pwm),ICR1中存放top值;
一个周期中,定时计数器TCNT1从0计数到匹配值时(OCR1A),将输出OC1x清零,
当计数到TOP值时(ICR1),将输出OC1x置位,并重新计数;
本程序不采用中断方式,而采用0.25S更新一次匹配寄存器数据的方式;

注意：与量程相关时，量程的最大值不能超过2000
*******************************************************************************/

#include "DA.h"

#include <ioctrl.h>

#include <intrinsics.h>
#include <comp_a90.h>

unsigned short DA_Vol;  //缓冲的当前DA值,范围0~DA_FULL

//----------------------------置满量程值函数-----------------------------
//得到满量程值来置定时器周期溢出值
//static void _SetFull(void)
#define _SetFull() do{ICR1 = DA_FULL; }while(0)

//-----------------------------初始化函数---------------------------------
//注:调用此模块后应立即调用DA_SetDA()实现零点输出
void DA_Init(void)
{
  ClrPWM();
  OutPWM();
  
  //控制寄存器设置
  //比较匹配时清零OC1A/OC1B， OC1A/OC1B在TOP 时置位; 模式14：快速PWM
  TCCR1A = (1 << COM1A1) | (1 << WGM11);
  //TCCR1B = (1 << WGM13) | (1 << WGM12) | (1 << CS12) | (1 << CS10);//无分频
  TCCR1B = (1 << WGM13) | (1 << WGM12) | (1 << CS10);//无分频
  _SetFull(); //置满量程值
  //DA_SetDA(0);  //浓度值更新

  TIFR |= (1 << OCF1A);
}

//----------------------------输出DA值-----------------------------------
void DA_SetDA(unsigned short DA)
{
  DA_Vol = DA;
  OCR1A = DA;  
}
