/*******************************************************************************

       低精度DA输出模块接口,在ASM32单片机PCA中（由PWM产生）实现

*******************************************************************************/

#include "DA8.h"
#include "IOCtrl.h"

//-----------------------------初始化函数---------------------------------
void DA8_Init(void)
{
  //使用 边沿 对齐 独立 PWM输出  固定使用模式2  
  CfgDA8();//IO与时钟允许
  DA8_CfgPWMOut();   //外部实现
  DA8_PCA->CCON |= (1 << 6);   //开启定时器
}

//----------------------------输出DA值-----------------------------------
void DA8_SetDA(unsigned char DA)
{
  DA8_PCA->DA8_CCAPH = DA;
}

//----------------------------得到输出DA值-----------------------------------
unsigned char DA8_GetDA(void)
{
  return DA8_PCA->DA8_CCAPH;
}




