/*****************************************************************************
	
//                     Modbus编解码实现模块

******************************************************************************/
#ifndef __MODBUS_CODEC_H
#define __MODBUS_CODEC_H

/*****************************************************************************
                          相关配置
******************************************************************************/

//全局定义
//#define SUPPORT_MODBUS_CRC_AUTO_ANTI 禁止自动识别CRC16位反向功能

/*****************************************************************************
                          相关函数
******************************************************************************/
    
//--------------------------作为从机时编解码函数--------------------------------
//只支持RTU模式
//返回-1表示错误;  0:数据正确，但不返回数据, 其它:返回数据个数
signed short ModbusCodec_Slv(unsigned char  *pData, //收到的数据
                             unsigned short RcvLen,//接收数据长度
                             unsigned char SlvAdr); //从机地址

/*****************************************************************************
                                回调函数
******************************************************************************/   
     
//-------------------------作为从机时编码函数--------------------------------
//返回-1表示错误;  0:数据正确，但不返回数据, 其它:返回数据个数(含地址)
signed short ModbusCodec_cbEncoder(unsigned char  *pData,//功能码开始
                                    unsigned short RcvData);//接收数据长度

#endif


