/*******************************************************************************

					            IPv4地址(含端口)定义与配置保存

********************************************************************************/
#ifndef __IPV4_CFG_H 
#define __IPV4_CFG_H

/****************************************************************************
                             相关配置
****************************************************************************/
#ifndef IPV4_CFG_COUNT
  #define IPV4_CFG_COUNT   1
#endif

/****************************************************************************
                             结构定义
****************************************************************************/

//定义IPv4结构:
struct _IpInfo{
  unsigned char Ip[4];  //4位IP地址
  unsigned short Port;  //端口号
};

struct _IPv4Cfg{
  struct _IpInfo Id[IPV4_CFG_COUNT];
};

extern struct _IPv4Cfg IPv4Cfg;

/****************************************************************************
                              相关函数
****************************************************************************/
//--------------------------------初始化函数------------------------------
void IPv4Cfg_Init(signed char IsInited);

//--------------------------------得到Id对应IP-----------------------------
#define IPv4Cfg_pGetIp(id)  (IPv4Cfg.Id[id].Ip)

//--------------------------------设置Id对应IP-----------------------------
void IPv4Cfg_SetIp(unsigned char Id, const unsigned char *pIpv4);

//--------------------------------得到Id对应IP对应位-----------------------
#define IPv4Cfg_GetIpPos(id,pos)  (IPv4Cfg.Id[id].Ip[pos])

//--------------------------------设置Id对应IP对应位-----------------------
void IPv4Cfg_SetIpPos(unsigned char Id, unsigned char Pos,
                        unsigned char PosAdr);

//--------------------------------得到Id对应端口----------------------------
#define IPv4Cfg_GetPort(id)  (IPv4Cfg.Id[id].Port)

//--------------------------------设置Id对应端口---------------------------
void IPv4Cfg_SetPort(unsigned char Id, unsigned short Port);

#endif

